Documents/ОменитьВнешнееПроизводство.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ОменитьВнешнееПроизводство</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Комплекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Комплект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
								<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ОменитьВнешнееПроизводство/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура КомплектыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьНаСервере(Проект, НеПоказывть)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если ЗначениеЗаполнено(Объект.Проект) Тогда
		
		НеПоказывть = Новый Массив;
		Для каждого СтрокаТЧ Из Объект.Комплекты Цикл
			НеПоказывть.Добавить(СтрокаТЧ.Комплект);
		КонецЦикла;
		
		ЗаполнитьНаСервере(Проект, НеПоказывть);
		
	Иначе
		
		ПоказатьПредупреждение(, "Не заполнен проект.");	
	
	КонецЕсли;
	
КонецПроцедуры
